Repository: jrachele/jrachele.com-old
Catalog: jrachele/translations/*/LC_MESSAGES/messages.po
Languages: fr

# about_me_meta_text
source: Web developer • Data scientist • Graphic designer
fr: Étudiant en Informatique

# protein_folding_link
source: REDCRAFT Protein Folding
fr: Repliement des Protéines avec REDCRAFT

# yeast_genome_link
source: Yeast Genome Visualization
fr: Visualisation du génome de levure

source: About Me
fr: Profil

# about_me_description
source: I am currently a Computer Science undergraduate at the University of South Carolina. I will be graduating in May 2020 with a Bachelor's degree, but I will continue for an extra year to receive my Masters. <br><br>I am interested in software engineering as a whole and have experience mobile app development, UI development, and full stack web development, but I have particular interests in the fields of compiler design, artificial intelligence, and algorithmic design. <br><br>My interests include studying foreign languages, cooking, and playing the piano. I am also a little competitive and enjoy playing video games with friends.<br><br>
fr: Je suis actuellement étudiant en licence d'informatique à l'University of South Carolina. Je recevrai mon diplôme en mai 2020, mais subsequémment je continuerai mes études pendant un an à la poursuite d'un master. <br><br>Je m'interesse à l'ingénerie logicielle en général, et je suis expérimenté en développement mobile, web, et UI, mais j'ai des intérêts spéciaux en intelligence artificielle, dans la construction des compilateurs, et dans la thérorie algorithmique. <br><br>Mes intérêts comprennent l'étude des langues étrangères (comme celle-ci), la cuisine, et jouer du piano. Je suis aussi un peu compétitif et je profite souvent de jouer aux jeux-vidéos multijouer.

source: Showcase
fr: Travaux

source: Recent work
fr: Travaux récents

source: Earlier work
fr: Travaux anciens

source: Graphic design
fr: Graphisme

# asterion_info
source: In the Summer of 2019, I lived and worked in western France as an intern for Astérion VR, where I produced a C++ implementation of a specialized AI pattern for use in Unreal Engine, which improved a simulation product aiding French counter-terrorist operations.
fr: En été 2019, j'ai vécu et travaillé dans l'ouest de la France en tant que stagier chez Astérion VR. C'est là où j'ai développé une implémentation d'un système avancé d'IU en C++, intégré dans le moteur Unreal. Cette IU servira des anti-terroristes français à l'entraînement pour l'extraction des otages pendant des moments cruciaux.

# protein_folding_info
source: I am currently aiding computational biologists in the optimization and facilitation of use of <b>REDCRAFT</b>, a software suite for computational protein folding written in C++. I have so far written several Python scripts to aid in data conversion for the software and I am working on implementing a graphical interface as well as optimizing some of the heavy-hitting computational areas.
fr: Je suis actuellement chargé d'optimiser et de faciliter l'utilisation d'un logiciel pour le repliement informatique des protéines. Au niveau d'optimisation, je fais du refactoring du code hértité en C++, et j'analyse l'efficacité de <b>REDCRAFT</b> à trouver la bonne configuration. De plus, je travaille actuellement à développer une GUI en Python pour utiliser REDCRAFT plus facilement.

# yeast_genome_info
source: I have created a 3d visualization of the yeast genome in Python, originally with Jupyter, that uses <b>Plotly</b>, <b>pandas</b>, <b>numpy</b>, and <b>scipy</b> to analyze large data sets representing chromatin location and mean square displacement, restricts the data in useful ways, optionally clusters similar data bits, and outputs a three-dimensional representation of the nucelus.
fr: Une visualisation du génome de levure hébergée sur ce site, programmée en Python avec les libairies <b>Plotly</b> et <b>Dash</b>. J'ai également utilisé <b>Pandas</b>, <b>Numpy</b>, et <b>Scipy</b> pour la manipulation des données.

# dr_vasquez_info
source: I was originally to only port MATLAB applications to the web, though Dr. Vasquez's site needed an overhaul. Using <b>Bootstrap</b> and <b>Plotly.js</b>, I created a new stylish site and remade all the MATLAB applications to be web-friendly.
fr: Au début, on m'a chargé de convertir des applications MATLAB pour internet. Néanmoins, vu que le site de Dr. Vasquez était obsolète, j'étais chargé de tout reproduire, en utilisant <b>Bootstrap</b> et <b>Plotly.js</b>.

# portfolio_link
source: Graphic Design Portfolio
fr: Portfolio de graphisme

# portfolio_info
source: Having volunteered with Donate Life South Carolina for years now, I have created numerous pieces of artwork to help promote Organ and Tissue Donation. I have also attached some creative works I made in my spare time.
fr: Je fais du graphisme volontairement depuis de nombreuses années chez Donate Life, pour promouvoir la donation d'organes et de tissus en Caroline du Sud. Mon portfolio contient aussi quelques travaux personels.

source: Education & Experience
fr: Éducation et Expérience

source: Class of 2020
fr: Terminant en 2020

# usc_info
source: B.S. Computer Science - University of South Carolina
fr: Licence Science Informatique - University of South Carolina

source: 2018 - Now
fr: 2018 - Aujourd'hui

# valafar_datascience
source: Research Assistant - UofSC Computational Biology
fr: Assistant de Recherche - UofSC Computational Biology

# curriculumx_fullstack
source: Fullstack Developer - CurriculumX.org
fr: Développeur Fullstack - CurriculumX

source: 2010 - Now
fr: 2010 - Aujourd'hui

# donatelife_volunteer
source: Volunteer - Donate Life South Carolina
fr: Volontaire - Donate Life South Carolina

# mathdep_datascience
source: Data Scientist - UofSC Math Department
fr: Scientifique de données - Département de Maths

# mathdep_web
source: Web Developer - UofSC Math Department
fr: Développeur Web - Département de Maths

source: Class of 2016
fr: Diplômé en 2016

# highschool
source: High School Diploma - Wade Hamption High School
fr: au lycée - Wade Hamption High School

source: Languages
fr: Compétences

# haskell_description
source: I am fairly proficient in Haskell, and have written an interpreter with it.
fr: Je suis compétent en Haskell, l'ayant utilisé pour développer un interpréteur basique.

# python_description
source: I am competent in Python and Django, having used them for years.
fr: Compétence en Python et Django, les ayant utilisé pour plusieurs projets.

# cpp_description
source: C++ is the language I have used the most for work-related projects.
fr: C'est le langage que je connais le mieux, l'ayant utilisé le plus pour mon travail.

# js_description
source: I have recently been learning to use React to supplement my front-end knowledge.
fr: Compétence en JavaScript de base, et apprentissage de React/Redux.

source: French
fr: Français

# french_description
source: I speak French at a C1 level, but read and write at C2.
fr: Je parle couramment français et je peux facilement communiquer dans des situations professionelles.
